server/app/controllers/bathrooms_controller.rb

  def add

    @bathroom = Bathroom.create

    @bathroom.isHandicapAccessible = params[:isHandicapAccessible]
    @bathroom.isPublic = params[:isPublic]
    @bathroom.isFamily = params[:isFamily]
    @bathroom.isGreen = params[:isGreen]
    @bathroom.isUnisex = params[:isUnisex]
    @bathroom.isHandsFree = params[:isHandsFree]
    @bathroom.hasProductDispenser = params[:hasProductDispenser]
    @bathroom.hasAttendent = params[:hasAttendant]
    @bathroom.hasSignage = params[:hasSignage]
    @bathroom.hasWifi = params[:hasWifi]

    @bathroom.save
---
INSERT INTO "bathrooms" ("BathroomType_id", "created_at", "hasAttendent", "hasProductDispenser", "hasSignage", "hasWifi", "isFamily", "isGreen", "isHandicapAccessible", "isHandsFree", "isPublic", "isUnisex", "updated_at", "venue_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
UPDATE "bathrooms" SET "isPublic" = 't', "updated_at" = '2012-10-06 17:35:33.605202' WHERE "bathrooms"."id" = 7